ikaielabs/ikai-annex-sdk/mcu-sdk/hal/stm32/annex/src/annex_hal_uart_st.c
#include "annex_hal_uart.h"
#include "stm32f4xx_hal.h"

#include <stddef.h>
#include <string.h>

struct annex_hal_uart_dev {
    UART_HandleTypeDef hal_handle;
    annex_hal_uart_config_t cfg;
    uint32_t irq_mask;
    uint32_t irq_status;
    uint8_t in_use;
    uint8_t lin_mode;
};

#define ANNEX_HAL_UART_MAX_DEVS 4U

static struct annex_hal_uart_dev s_dev_pool[ANNEX_HAL_UART_MAX_DEVS];

static uint32_t annex_hal_uart_map_parity(uint8_t parity)
{
    switch (parity) {
    case 1:
        return UART_PARITY_ODD;
    case 2:
        return UART_PARITY_EVEN;
    default:
        return UART_PARITY_NONE;
    }
}

static uint32_t annex_hal_uart_map_stop_bits(uint8_t stop_bits)
{
    return (stop_bits == 2U) ? UART_STOPBITS_2 : UART_STOPBITS_1;
}

static uint32_t annex_hal_uart_map_word_length(uint8_t data_bits)
{
    return (data_bits == 9U) ? UART_WORDLENGTH_9B : UART_WORDLENGTH_8B;
}

annex_hal_uart_dev_t *annex_hal_uart_open(const annex_hal_uart_hw_desc_t *hw)
{
    if (hw == NULL || hw->base_addr == 0U) {
        return NULL;
    }

    for (size_t i = 0; i < ANNEX_HAL_UART_MAX_DEVS; i++) {
        if (!s_dev_pool[i].in_use) {
            memset(&s_dev_pool[i], 0, sizeof(s_dev_pool[i]));
            s_dev_pool[i].hal_handle.Instance = (USART_TypeDef *)hw->base_addr;
            s_dev_pool[i].cfg.baud_rate = 9600U;
            s_dev_pool[i].cfg.data_bits = 8U;
            s_dev_pool[i].cfg.stop_bits = 1U;
            s_dev_pool[i].cfg.parity = 0U;
            s_dev_pool[i].cfg.flow_control = 0U;
            s_dev_pool[i].in_use = 1U;
            return &s_dev_pool[i];
        }
    }

    return NULL;
}

void annex_hal_uart_close(annex_hal_uart_dev_t *dev)
{
    if (dev == NULL) {
        return;
    }

    HAL_UART_DeInit(&dev->hal_handle);
    dev->in_use = 0U;
}

int annex_hal_uart_config(annex_hal_uart_dev_t *dev, const annex_hal_uart_config_t *cfg)
{
    if (dev == NULL || cfg == NULL) {
        return -1;
    }

    memcpy(&dev->cfg, cfg, sizeof(*cfg));

    dev->hal_handle.Init.BaudRate = cfg->baud_rate;
    dev->hal_handle.Init.WordLength = annex_hal_uart_map_word_length(cfg->data_bits);
    dev->hal_handle.Init.StopBits = annex_hal_uart_map_stop_bits(cfg->stop_bits);
    dev->hal_handle.Init.Parity = annex_hal_uart_map_parity(cfg->parity);
    dev->hal_handle.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    dev->hal_handle.Init.Mode = UART_MODE_TX_RX;
    dev->hal_handle.Init.OverSampling = UART_OVERSAMPLING_16;

    if (HAL_UART_Init(&dev->hal_handle) != HAL_OK) {
        return -1;
    }

    return 0;
}

int annex_hal_uart_write_fifo_u8(annex_hal_uart_dev_t *dev, const uint8_t *data, uint32_t len, uint32_t timeout)
{
    if (dev == NULL || data == NULL || len == 0U) {
        return -1;
    }

    HAL_StatusTypeDef hal_status = HAL_UART_Transmit(&dev->hal_handle, data, len, timeout);

    if (hal_status != HAL_OK) {
        return -1;
    }

    return 0;

}

int annex_hal_uart_write_fifo_u16(annex_hal_uart_dev_t *dev, const uint16_t *data, uint32_t len, uint32_t timeout)
{
    (void)dev;
    (void)data;
    (void)len;
    return -1;
}

int annex_hal_uart_read_fifo_u8(annex_hal_uart_dev_t *dev, uint8_t *data, uint32_t len, uint32_t timeout)
{
    if (dev == NULL || data == NULL || len == 0U) {
        return -1;
    }

    HAL_StatusTypeDef hal_status =  HAL_UART_Receive(&dev->hal_handle, data, len, timeout);

    if (hal_status != HAL_OK) {
        return -1;
    }

    return 0;
}

int annex_hal_uart_read_fifo_u16(annex_hal_uart_dev_t *dev, uint16_t *data, uint32_t len, uint32_t timeout)
{
    (void)dev;
    (void)data;
    (void)len;
    return -1;
}

int annex_hal_uart_start(annex_hal_uart_dev_t *dev, bool tx_enable, bool rx_enable)
{
    if (dev == NULL || dev->hal_handle.Instance == NULL) {
        return -1;
    }

    USART_TypeDef *usart = dev->hal_handle.Instance;

    CLEAR_BIT(usart->CR1, USART_CR1_TE | USART_CR1_RE);
    if (tx_enable) {
        SET_BIT(usart->CR1, USART_CR1_TE);
    }
    if (rx_enable) {
        SET_BIT(usart->CR1, USART_CR1_RE);
    }

    __HAL_UART_ENABLE(&dev->hal_handle);
    return 0;
}

int annex_hal_uart_stop(annex_hal_uart_dev_t *dev)
{
    if (dev == NULL || dev->hal_handle.Instance == NULL) {
        return -1;
    }

    USART_TypeDef *usart = dev->hal_handle.Instance;
    CLEAR_BIT(usart->CR1, USART_CR1_TE | USART_CR1_RE | USART_CR1_UE);
    return 0;
}

/*
 * annex_hal_uart_lin_init() is the proper entry point into LIN mode on
 * STM32. It goes through the ST HAL's dedicated HAL_LIN_Init(), which:
 *   - re-applies the UART_InitTypeDef fields already populated by
 *     annex_hal_uart_config() (baud rate, word length, etc.)
 *   - sets USART_CR2_LINEN for us
 *   - programs the break-detection length (LBDL): 10-bit or 11-bit,
 *     which is the one piece of "how long is a break" that STM32 UART
 *     actually exposes a register for.
 *
 * This replaces the previous approach of hand-toggling CR2_LINEN, which
 * bypassed the HAL entirely and gave the caller no way to select a
 * break-detection length.
 *
 * break_length_bits: pass 11 for an 11-bit break detection length
 * (LIN 2.x / most masters), anything else selects 10-bit (LIN 1.x).
 */
int annex_hal_uart_lin_init(annex_hal_uart_dev_t *dev, uint8_t break_length_bits)
{
    if (dev == NULL || dev->hal_handle.Instance == NULL) {
        return -1;
    }

    uint8_t break_len_bits = (break_length_bits >= 11U) ? UART_LINBREAKDETECTLENGTH_11B : UART_LINBREAKDETECTLENGTH_10B;

    if (HAL_LIN_Init(&dev->hal_handle, break_len_bits) != HAL_OK) {
        return -1;
    }

    dev->lin_mode = 1U;
    return 0;
}

/*
 * Kept for backward compatibility with callers that only want to flip
 * LIN mode without picking a break-detection length. Prefer
 * annex_hal_uart_lin_init() for actually entering LIN mode; passing
 * enable=false here just clears LIN mode back to plain UART.
 */
int annex_hal_uart_set_lin_mode(annex_hal_uart_dev_t *dev, bool enable)
{
    if (dev == NULL || dev->hal_handle.Instance == NULL) {
        return -1;
    }

    if (enable) {
        return annex_hal_uart_lin_init(dev, 11U);
    }

    CLEAR_BIT(dev->hal_handle.Instance->CR2, USART_CR2_LINEN);
    dev->lin_mode = 0U;
    return 0;
}

/*
 * Sends a LIN break field via the HAL's own HAL_LIN_SendBreak(), rather
 * than setting USART_CR1_SBK by hand. HAL_LIN_SendBreak() sets SBK and
 * returns without waiting for it to clear, so we still poll
 * Transmission Complete (TC) here to give callers a synchronous
 * "break is on the wire" guarantee, matching the previous behavior.
 *
 * Note this no longer silently forces LIN mode on if it isn't already
 * configured -- annex_hal_uart_lin_init() must have been called once,
 * at LIN configuration time, not on every break.
 */
int annex_hal_uart_send_break(annex_hal_uart_dev_t *dev)
{
    if (dev == NULL || dev->hal_handle.Instance == NULL) {
        return -1;
    }

    if (!dev->lin_mode) {
        return -1;
    }

    if (HAL_LIN_SendBreak(&dev->hal_handle) != HAL_OK) {
        return -1;
    }

    USART_TypeDef *usart = dev->hal_handle.Instance;
    uint32_t timeout = 100000U;
    while ((READ_BIT(usart->SR, USART_SR_TC) == 0U) && timeout--) {
        ;
    }

    return (timeout != 0U) ? 0 : -1;
}

void annex_hal_uart_enable_irq(annex_hal_uart_dev_t *dev, uint32_t irqs)
{
    if (dev == NULL) {
        return;
    }

    dev->irq_mask |= irqs;

    if (irqs & ANNEX_HAL_UART_IRQ_RX_READY) {
        __HAL_UART_ENABLE_IT(&dev->hal_handle, UART_IT_RXNE);
    }
    if (irqs & ANNEX_HAL_UART_IRQ_TX_EMPTY) {
        __HAL_UART_ENABLE_IT(&dev->hal_handle, UART_IT_TXE);
    }
    if (irqs & (ANNEX_HAL_UART_IRQ_RX_OVERRUN | ANNEX_HAL_UART_IRQ_FRAME_ERR)) {
        __HAL_UART_ENABLE_IT(&dev->hal_handle, UART_IT_ERR);
    }
}

void annex_hal_uart_disable_irq(annex_hal_uart_dev_t *dev, uint32_t irqs)
{
    if (dev == NULL) {
        return;
    }

    dev->irq_mask &= ~irqs;

    if ((irqs & ANNEX_HAL_UART_IRQ_RX_READY) && !(dev->irq_mask & ANNEX_HAL_UART_IRQ_RX_READY)) {
        __HAL_UART_DISABLE_IT(&dev->hal_handle, UART_IT_RXNE);
    }
    if ((irqs & ANNEX_HAL_UART_IRQ_TX_EMPTY) && !(dev->irq_mask & ANNEX_HAL_UART_IRQ_TX_EMPTY)) {
        __HAL_UART_DISABLE_IT(&dev->hal_handle, UART_IT_TXE);
    }
    if ((irqs & (ANNEX_HAL_UART_IRQ_RX_OVERRUN | ANNEX_HAL_UART_IRQ_FRAME_ERR)) &&
        !(dev->irq_mask & (ANNEX_HAL_UART_IRQ_RX_OVERRUN | ANNEX_HAL_UART_IRQ_FRAME_ERR))) {
        __HAL_UART_DISABLE_IT(&dev->hal_handle, UART_IT_ERR);
    }
}

uint32_t annex_hal_uart_get_irq_status(annex_hal_uart_dev_t *dev)
{
    if (dev == NULL) {
        return 0U;
    }

    USART_TypeDef *usart = dev->hal_handle.Instance;
    uint32_t status = 0U;

    if ((READ_BIT(usart->SR, USART_SR_RXNE) != 0U)) {
        status |= ANNEX_HAL_UART_IRQ_RX_READY;
    }
    if ((READ_BIT(usart->SR, USART_SR_TXE) != 0U)) {
        status |= ANNEX_HAL_UART_IRQ_TX_EMPTY;
    }
    if ((READ_BIT(usart->SR, USART_SR_ORE) != 0U)) {
        status |= ANNEX_HAL_UART_IRQ_RX_OVERRUN;
    }
    if ((READ_BIT(usart->SR, USART_SR_FE) != 0U)) {
        status |= ANNEX_HAL_UART_IRQ_FRAME_ERR;
    }

    dev->irq_status = status;
    return status & dev->irq_mask;
}

void annex_hal_uart_clear_irq(annex_hal_uart_dev_t *dev, uint32_t irqs)
{
    if (dev == NULL) {
        return;
    }

    dev->irq_status &= ~irqs;
}
